orulink-ai/WatcheRobot/firmware/stm32-f103/User/Device/servo/servo.c
#include "servo.h"

#include "platform_pwm.h"
#include "platform_time.h"
#include "stm32f1xx_hal_adc_ex.h"

/*
 * Keep a fixed servo instance pool to avoid dynamic allocation in the MCU
 * runtime while still supporting multiple timer channels.
 */
typedef struct {
    Servo_ConfigTypeDef config;
    Servo_StateTypeDef state;
    uint8_t inUse;
} Servo_InstanceTypeDef;

static Servo_InstanceTypeDef s_servoPool[SERVO_MAX_INSTANCES];

#define SERVO_ANTI_DROP_PRELOAD_US 18U
#define SERVO_ANTI_DROP_PRELOAD_PERCENT 8U
#define SERVO_ANTI_DROP_HOLD_PERCENT 6U
#define SERVO_ANTI_DROP_MIN_STEP_US 4U

static Servo_InstanceTypeDef *Servo_GetInstance(Servo_HandleTypeDef servo);
static Servo_StatusTypeDef Servo_StartPwmOutput(Servo_ConfigTypeDef *config);
static Servo_StatusTypeDef Servo_WritePulseInternal(Servo_ConfigTypeDef *config, uint16_t pulse);
static Servo_StatusTypeDef Servo_InitFeedback(Servo_ConfigTypeDef *config);
static Servo_StatusTypeDef Servo_ReadFeedbackPair(ADC_HandleTypeDef *adcHandle, uint16_t *sample1, uint16_t *sample2);
static uint16_t Servo_ClampPulse(const Servo_ConfigTypeDef *config, uint16_t pulse);
static uint16_t Servo_AngleToPulse(const Servo_ConfigTypeDef *config, uint8_t angle);
static uint16_t Servo_NormalizeMotionUpdatePeriod(uint16_t updatePeriodMs);
static uint16_t Servo_InterpolateSmoothStepPulse(uint16_t startPulse,
                                                 uint16_t targetPulse,
                                                 uint32_t elapsedMs,
                                                 uint16_t durationMs,
                                                 uint8_t easeStrengthPercent);
static uint16_t Servo_InterpolatePulse(uint16_t startPulse,
                                       uint16_t targetPulse,
                                       uint32_t elapsedMs,
                                       uint16_t durationMs,
                                       Servo_MotionProfileTypeDef profile,
                                       uint8_t easeStrengthPercent);
static uint8_t Servo_ShouldSkipSmallAntiDropStep(const Servo_StateTypeDef *state, uint16_t nextPulse, uint8_t complete);
static Servo_StatusTypeDef Servo_UpdateMotionAt(Servo_InstanceTypeDef *instance, uint32_t nowTickMs, uint8_t force);
static void Servo_ArmReleaseDeadline(Servo_InstanceTypeDef *instance, uint32_t nowTickMs);
static void Servo_ReleaseSignalInternal(Servo_InstanceTypeDef *instance);
static uint8_t Servo_HasDeadlineElapsed(uint32_t nowTickMs, uint32_t deadlineTickMs);

Servo_HandleTypeDef Servo_Init(const Servo_ConfigTypeDef *config)
{
    Servo_InstanceTypeDef *instance = NULL;
    uint8_t index;
    uint32_t nowTickMs;

    if ((config == NULL) || (config->pTimHandle == NULL)) {
        return NULL;
    }
    if (config->pulseMin >= config->pulseMax) {
        return NULL;
    }
    if ((config->stepSize == 0U) || (config->stepDelayMs == 0U)) {
        return NULL;
    }
    if ((config->pFeedbackAdcHandle != NULL) &&
        ((config->feedbackSampleIndex < 1U) || (config->feedbackSampleIndex > 2U) ||
         (config->feedbackRawMin >= config->feedbackRawMax))) {
        return NULL;
    }

    for (index = 0U; index < SERVO_MAX_INSTANCES; index++) {
        if (s_servoPool[index].inUse == 0U) {
            instance = &s_servoPool[index];
            break;
        }
    }

    if (instance == NULL) {
        return NULL;
    }

    if (Servo_StartPwmOutput((Servo_ConfigTypeDef *)config) != SERVO_OK) {
        return NULL;
    }
    if (Servo_InitFeedback((Servo_ConfigTypeDef *)config) != SERVO_OK) {
        return NULL;
    }

    nowTickMs = Platform_Time_GetTickMs();

    instance->config = *config;
    instance->state.currentPulse = config->pulseCenter;
    instance->state.targetPulse = config->pulseCenter;
    instance->state.motionStartPulse = config->pulseCenter;
    instance->state.motionTargetPulse = config->pulseCenter;
    instance->state.motionDurationMs = 0U;
    instance->state.motionUpdatePeriodMs = SERVO_MOTION_UPDATE_PERIOD_MS;
    instance->state.motionEaseStrengthPercent = SERVO_MOTION_EASE_STRENGTH_DEFAULT_PERCENT;
    instance->state.direction = SERVO_DIRECTION_NONE;
    instance->state.motionProfile = SERVO_MOTION_PROFILE_LINEAR;
    instance->state.isReciprocating = 0U;
    instance->state.isMotionActive = 0U;
    instance->state.isInitialized = 1U;
    instance->state.isSignalActive = 0U;
    instance->state.lastStepTickMs = nowTickMs;
    instance->state.motionStartedAtMs = nowTickMs;
    instance->state.lastMotionUpdateTickMs = nowTickMs;
    instance->state.releaseDeadlineMs = nowTickMs;
    instance->inUse = 1U;

    if (Servo_WritePulseInternal(&instance->config, instance->state.currentPulse) != SERVO_OK) {
        instance->inUse = 0U;
        instance->state.isInitialized = 0U;
        return NULL;
    }

    instance->state.isSignalActive = 1U;
    Servo_ArmReleaseDeadline(instance, nowTickMs);

    return (Servo_HandleTypeDef)instance;
}

Servo_StatusTypeDef Servo_DeInit(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    Servo_ReleaseSignalInternal(instance);
    instance->inUse = 0U;
    instance->state.isInitialized = 0U;

    return SERVO_OK;
}

Servo_StatusTypeDef Servo_SetPulse(Servo_HandleTypeDef servo, uint16_t pulseUs)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    pulseUs = Servo_ClampPulse(&instance->config, pulseUs);

    instance->state.isMotionActive = 0U;
    instance->state.isReciprocating = 0U;
    instance->state.direction = SERVO_DIRECTION_NONE;
    instance->state.currentPulse = pulseUs;
    instance->state.targetPulse = pulseUs;
    instance->state.motionStartPulse = pulseUs;
    instance->state.motionTargetPulse = pulseUs;
    instance->state.motionDurationMs = 0U;
    instance->state.motionUpdatePeriodMs = SERVO_MOTION_UPDATE_PERIOD_MS;
    instance->state.motionEaseStrengthPercent = SERVO_MOTION_EASE_STRENGTH_DEFAULT_PERCENT;

