orulink-ai/WatcheRobot/firmware/stm32-f103/User/Device/servo/servo.c
    if (Servo_WritePulseInternal(&instance->config, pulseUs) != SERVO_OK) {
        return SERVO_ERROR_PARAM;
    }

    instance->state.isSignalActive = 1U;
    Servo_ArmReleaseDeadline(instance, Platform_Time_GetTickMs());

    return SERVO_OK;
}

Servo_StatusTypeDef Servo_GetPulse(Servo_HandleTypeDef servo, uint16_t *pulseUs)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if ((instance == NULL) || (pulseUs == NULL)) {
        return SERVO_ERROR_PARAM;
    }

    *pulseUs = instance->state.currentPulse;
    return SERVO_OK;
}

Servo_StatusTypeDef Servo_SetAngle(Servo_HandleTypeDef servo, uint8_t angle)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);
    uint16_t pulseUs;

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    pulseUs = Servo_AngleToPulse(&instance->config, angle);

    return Servo_SetPulse(servo, pulseUs);
}

Servo_StatusTypeDef Servo_MoveToPulseOverTime(Servo_HandleTypeDef servo,
                                              uint16_t pulseUs,
                                              uint16_t durationMs,
                                              Servo_MotionProfileTypeDef profile)
{
    return Servo_MoveToPulseOverTimeWithUpdatePeriod(servo,
                                                     pulseUs,
                                                     durationMs,
                                                     profile,
                                                     SERVO_MOTION_UPDATE_PERIOD_MS);
}

Servo_StatusTypeDef Servo_MoveToPulseOverTimeWithUpdatePeriod(Servo_HandleTypeDef servo,
                                                              uint16_t pulseUs,
                                                              uint16_t durationMs,
                                                              Servo_MotionProfileTypeDef profile,
                                                              uint16_t updatePeriodMs)
{
    return Servo_MoveToPulseOverTimeWithUpdatePeriodAndEaseStrength(servo,
                                                                    pulseUs,
                                                                    durationMs,
                                                                    profile,
                                                                    updatePeriodMs,
                                                                    SERVO_MOTION_EASE_STRENGTH_DEFAULT_PERCENT);
}

Servo_StatusTypeDef Servo_MoveToPulseOverTimeWithUpdatePeriodAndEaseStrength(Servo_HandleTypeDef servo,
                                                                             uint16_t pulseUs,
                                                                             uint16_t durationMs,
                                                                             Servo_MotionProfileTypeDef profile,
                                                                             uint16_t updatePeriodMs,
                                                                             uint8_t easeStrengthPercent)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);
    uint32_t nowTickMs;

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    if ((profile != SERVO_MOTION_PROFILE_LINEAR) &&
        (profile != SERVO_MOTION_PROFILE_EASE_IN_OUT) &&
        (profile != SERVO_MOTION_PROFILE_ANTI_DROP)) {
        return SERVO_ERROR_PARAM;
    }
    if (easeStrengthPercent > SERVO_MOTION_EASE_STRENGTH_MAX_PERCENT) {
        return SERVO_ERROR_PARAM;
    }

    pulseUs = Servo_ClampPulse(&instance->config, pulseUs);
    if ((durationMs == 0U) || (pulseUs == instance->state.currentPulse)) {
        return Servo_SetPulse(servo, pulseUs);
    }

    nowTickMs = Platform_Time_GetTickMs();
    instance->state.isReciprocating = 0U;
    instance->state.direction = SERVO_DIRECTION_NONE;
    instance->state.isMotionActive = 1U;
    instance->state.isSignalActive = 1U;
    instance->state.motionStartPulse = instance->state.currentPulse;
    instance->state.motionTargetPulse = pulseUs;
    instance->state.targetPulse = pulseUs;
    instance->state.motionDurationMs = durationMs;
    instance->state.motionUpdatePeriodMs = Servo_NormalizeMotionUpdatePeriod(updatePeriodMs);
    instance->state.motionEaseStrengthPercent = easeStrengthPercent;
    instance->state.motionProfile = profile;
    instance->state.motionStartedAtMs = nowTickMs;
    instance->state.lastMotionUpdateTickMs = nowTickMs;

    return Servo_WritePulseInternal(&instance->config, instance->state.currentPulse);
}

Servo_StatusTypeDef Servo_MoveToAngleOverTime(Servo_HandleTypeDef servo,
                                              uint8_t angle,
                                              uint16_t durationMs,
                                              Servo_MotionProfileTypeDef profile)
{
    return Servo_MoveToAngleOverTimeWithUpdatePeriod(servo,
                                                     angle,
                                                     durationMs,
                                                     profile,
                                                     SERVO_MOTION_UPDATE_PERIOD_MS);
}

Servo_StatusTypeDef Servo_MoveToAngleOverTimeWithUpdatePeriod(Servo_HandleTypeDef servo,
                                                              uint8_t angle,
                                                              uint16_t durationMs,
                                                              Servo_MotionProfileTypeDef profile,
                                                              uint16_t updatePeriodMs)
{
    return Servo_MoveToAngleOverTimeWithUpdatePeriodAndEaseStrength(servo,
                                                                    angle,
                                                                    durationMs,
                                                                    profile,
                                                                    updatePeriodMs,
                                                                    SERVO_MOTION_EASE_STRENGTH_DEFAULT_PERCENT);
}

