orulink-ai/WatcheRobot/firmware/stm32-f103/User/Device/servo/servo.c
Servo_StatusTypeDef Servo_MoveToAngleOverTimeWithUpdatePeriodAndEaseStrength(Servo_HandleTypeDef servo,
                                                                             uint8_t angle,
                                                                             uint16_t durationMs,
                                                                             Servo_MotionProfileTypeDef profile,
                                                                             uint16_t updatePeriodMs,
                                                                             uint8_t easeStrengthPercent)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    return Servo_MoveToPulseOverTimeWithUpdatePeriodAndEaseStrength(servo,
                                                                    Servo_AngleToPulse(&instance->config, angle),
                                                                    durationMs,
                                                                    profile,
                                                                    updatePeriodMs,
                                                                    easeStrengthPercent);
}

uint16_t Servo_MotionUpdatePeriodFromSteps(uint16_t durationMs, uint16_t requestedSteps)
{
    uint32_t roundedPeriodMs;

    if ((durationMs == 0U) || (requestedSteps == 0U)) {
        return SERVO_MOTION_UPDATE_PERIOD_MS;
    }

    roundedPeriodMs = ((uint32_t)durationMs + ((uint32_t)requestedSteps / 2U)) / (uint32_t)requestedSteps;
    if (roundedPeriodMs == 0U) {
        roundedPeriodMs = 1U;
    }

    return Servo_NormalizeMotionUpdatePeriod((uint16_t)roundedPeriodMs);
}

Servo_StatusTypeDef Servo_StopMotion(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);
    uint32_t nowTickMs;

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    nowTickMs = Platform_Time_GetTickMs();
    if (instance->state.isMotionActive != 0U) {
        if (Servo_UpdateMotionAt(instance, nowTickMs, 1U) != SERVO_OK) {
            return SERVO_ERROR_PARAM;
        }
    }

    instance->state.isMotionActive = 0U;
    instance->state.isReciprocating = 0U;
    instance->state.direction = SERVO_DIRECTION_NONE;
    instance->state.targetPulse = instance->state.currentPulse;
    instance->state.motionTargetPulse = instance->state.currentPulse;
    instance->state.motionDurationMs = 0U;
    instance->state.motionUpdatePeriodMs = SERVO_MOTION_UPDATE_PERIOD_MS;
    instance->state.isSignalActive = 1U;
    Servo_ArmReleaseDeadline(instance, nowTickMs);

    return SERVO_OK;
}

Servo_StatusTypeDef Servo_GetFeedbackRaw(Servo_HandleTypeDef servo, uint16_t *adcRaw)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);
    uint32_t sum = 0U;
    uint16_t sample1;
    uint16_t sample2;
    uint8_t sampleIndex;

    if ((instance == NULL) || (adcRaw == NULL) || (instance->config.pFeedbackAdcHandle == NULL)) {
        return SERVO_ERROR_PARAM;
    }

    for (sampleIndex = 0U; sampleIndex < SERVO_FEEDBACK_AVG_SAMPLES; sampleIndex++) {
        if (Servo_ReadFeedbackPair(instance->config.pFeedbackAdcHandle, &sample1, &sample2) != SERVO_OK) {
            return SERVO_ERROR;
        }

        sum += (instance->config.feedbackSampleIndex == 1U) ? sample1 : sample2;
    }

    *adcRaw = (uint16_t)(sum / SERVO_FEEDBACK_AVG_SAMPLES);
    return SERVO_OK;
}

uint16_t Servo_ConvertFeedbackToMv(uint16_t adcRaw)
{
    if (adcRaw > SERVO_FEEDBACK_ADC_MAX) {
        adcRaw = SERVO_FEEDBACK_ADC_MAX;
    }

    return (uint16_t)(((uint32_t)adcRaw * SERVO_FEEDBACK_VREF_MV) / SERVO_FEEDBACK_ADC_MAX);
}

Servo_StatusTypeDef Servo_GetFeedbackAngle(Servo_HandleTypeDef servo, uint8_t *angle)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);
    uint16_t adcRaw;
    uint32_t scaledAngle;

    if ((instance == NULL) || (angle == NULL) || (instance->config.pFeedbackAdcHandle == NULL) ||
        (instance->config.feedbackRawMin >= instance->config.feedbackRawMax)) {
        return SERVO_ERROR_PARAM;
    }

    if (Servo_GetFeedbackRaw(servo, &adcRaw) != SERVO_OK) {
        return SERVO_ERROR;
    }

    if (adcRaw <= instance->config.feedbackRawMin) {
        *angle = 0U;
        return SERVO_OK;
    }
    if (adcRaw >= instance->config.feedbackRawMax) {
        *angle = 180U;
        return SERVO_OK;
    }

    scaledAngle = ((uint32_t)(adcRaw - instance->config.feedbackRawMin) * 180U) /
                  (uint32_t)(instance->config.feedbackRawMax - instance->config.feedbackRawMin);
    *angle = (uint8_t)scaledAngle;
    return SERVO_OK;
}

Servo_StatusTypeDef Servo_StartReciprocating(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    instance->state.isReciprocating = 1U;
    instance->state.isMotionActive = 0U;
    instance->state.direction = SERVO_DIRECTION_FORWARD;
    instance->state.lastStepTickMs = Platform_Time_GetTickMs();
    instance->state.isSignalActive = 1U;

    return Servo_WritePulseInternal(&instance->config, instance->state.currentPulse);
}

Servo_StatusTypeDef Servo_StopReciprocating(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    instance->state.isReciprocating = 0U;
    instance->state.direction = SERVO_DIRECTION_NONE;
    instance->state.isSignalActive = 1U;
    Servo_ArmReleaseDeadline(instance, Platform_Time_GetTickMs());

    return SERVO_OK;
}

Servo_StatusTypeDef Servo_ReleaseOutput(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    instance->state.isReciprocating = 0U;
    instance->state.isMotionActive = 0U;
    instance->state.direction = SERVO_DIRECTION_NONE;
    Servo_ReleaseSignalInternal(instance);

    return SERVO_OK;
}

uint8_t Servo_IsReciprocating(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

