orulink-ai/WatcheRobot/firmware/stm32-f103/User/Device/servo/servo.c
    return (instance == NULL) ? 0U : instance->state.isReciprocating;
}

uint8_t Servo_IsMotionActive(Servo_HandleTypeDef servo)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    return (instance == NULL) ? 0U : instance->state.isMotionActive;
}

void Servo_Update(void)
{
    uint8_t index;
    uint32_t nowTickMs = Platform_Time_GetTickMs();

    for (index = 0U; index < SERVO_MAX_INSTANCES; index++) {
        Servo_InstanceTypeDef *instance = &s_servoPool[index];

        if ((instance->inUse == 0U) || (instance->state.isInitialized == 0U)) {
            continue;
        }

        if (instance->state.isMotionActive != 0U) {
            (void)Servo_UpdateMotionAt(instance, nowTickMs, 0U);
            continue;
        }

        if (instance->state.isReciprocating != 0U) {
            if ((uint32_t)(nowTickMs - instance->state.lastStepTickMs) < instance->config.stepDelayMs) {
                continue;
            }

            instance->state.lastStepTickMs = nowTickMs;

            if (instance->state.direction == SERVO_DIRECTION_FORWARD) {
                instance->state.currentPulse = (uint16_t)(instance->state.currentPulse + instance->config.stepSize);

                if (instance->state.currentPulse >= instance->config.pulseMax) {
                    instance->state.currentPulse = instance->config.pulseMax;
                    instance->state.direction = SERVO_DIRECTION_BACKWARD;
                }
            } else if (instance->state.direction == SERVO_DIRECTION_BACKWARD) {
                if (instance->state.currentPulse > instance->config.pulseMin) {
                    instance->state.currentPulse =
                        (uint16_t)(instance->state.currentPulse - instance->config.stepSize);

                    if (instance->state.currentPulse <= instance->config.pulseMin) {
                        instance->state.currentPulse = instance->config.pulseMin;
                        instance->state.direction = SERVO_DIRECTION_FORWARD;
                    }
                } else {
                    instance->state.direction = SERVO_DIRECTION_FORWARD;
                }
            }

            instance->state.targetPulse = instance->state.currentPulse;
            (void)Servo_WritePulseInternal(&instance->config, instance->state.currentPulse);
            continue;
        }

        if ((instance->config.commandPulseCount != 0U) && (instance->state.isSignalActive != 0U) &&
            (Servo_HasDeadlineElapsed(nowTickMs, instance->state.releaseDeadlineMs) != 0U)) {
            Servo_ReleaseSignalInternal(instance);
        }
    }
}

Servo_StatusTypeDef Servo_GetState(Servo_HandleTypeDef servo, Servo_StateTypeDef *state)
{
    Servo_InstanceTypeDef *instance = Servo_GetInstance(servo);

    if ((instance == NULL) || (state == NULL)) {
        return SERVO_ERROR_PARAM;
    }

    *state = instance->state;
    return SERVO_OK;
}

static Servo_InstanceTypeDef *Servo_GetInstance(Servo_HandleTypeDef servo)
{
    if (servo == NULL) {
        return NULL;
    }

    return (Servo_InstanceTypeDef *)servo;
}

static Servo_StatusTypeDef Servo_StartPwmOutput(Servo_ConfigTypeDef *config)
{
    return (Platform_Pwm_Start(config->pTimHandle, config->TimChannel) == HAL_OK) ? SERVO_OK : SERVO_ERROR_INIT;
}

static Servo_StatusTypeDef Servo_WritePulseInternal(Servo_ConfigTypeDef *config, uint16_t pulse)
{
    return (Platform_Pwm_WritePulse(config->pTimHandle, config->TimChannel, pulse) == HAL_OK)
               ? SERVO_OK
               : SERVO_ERROR_PARAM;
}

static uint16_t Servo_ClampPulse(const Servo_ConfigTypeDef *config, uint16_t pulse)
{
    if (config == NULL) {
        return pulse;
    }

    if (pulse < config->pulseMin) {
        return config->pulseMin;
    }
    if (pulse > config->pulseMax) {
        return config->pulseMax;
    }
    return pulse;
}

static uint16_t Servo_AngleToPulse(const Servo_ConfigTypeDef *config, uint8_t angle)
{
    uint16_t pulseRange;

    if (config == NULL) {
        return SERVO_DEFAULT_PULSE_CENTER;
    }

    if (angle > 180U) {
        angle = 180U;
    }

    pulseRange = (uint16_t)(config->pulseMax - config->pulseMin);
    return (uint16_t)(config->pulseMin + ((uint32_t)angle * pulseRange / 180U));
}

static uint16_t Servo_NormalizeMotionUpdatePeriod(uint16_t updatePeriodMs)
{
    if (updatePeriodMs == 0U) {
        return SERVO_MOTION_UPDATE_PERIOD_MS;
    }
    if (updatePeriodMs < SERVO_MOTION_UPDATE_PERIOD_MIN_MS) {
        return SERVO_MOTION_UPDATE_PERIOD_MIN_MS;
    }
    return updatePeriodMs;
}

static uint16_t Servo_InterpolateSmoothStepPulse(uint16_t startPulse,
                                                 uint16_t targetPulse,
                                                 uint32_t elapsedMs,
                                                 uint16_t durationMs,
                                                 uint8_t easeStrengthPercent)
{
    int32_t delta = (int32_t)targetPulse - (int32_t)startPulse;
    int32_t step;
    uint64_t elapsed;
    uint64_t duration;
    uint64_t linearNumerator;
    uint64_t smoothNumerator;
    uint64_t blendedNumerator;
    uint64_t denominator;
    uint32_t strength;

    if ((durationMs == 0U) || (elapsedMs >= durationMs)) {
        return targetPulse;
    }

    elapsed = elapsedMs;
    duration = durationMs;
    strength = easeStrengthPercent;
    if (strength > SERVO_MOTION_EASE_STRENGTH_MAX_PERCENT) {
        strength = SERVO_MOTION_EASE_STRENGTH_MAX_PERCENT;
    }

    linearNumerator = elapsed * duration * duration;
    smoothNumerator = elapsed * elapsed * ((3ULL * duration) - (2ULL * elapsed));
    blendedNumerator = ((linearNumerator * (SERVO_MOTION_EASE_STRENGTH_MAX_PERCENT - strength)) +
                        (smoothNumerator * strength) +
                        (SERVO_MOTION_EASE_STRENGTH_MAX_PERCENT / 2U)) /
                       SERVO_MOTION_EASE_STRENGTH_MAX_PERCENT;
    denominator = duration * duration * duration;

    if (delta >= 0) {
        step = (int32_t)(((uint64_t)delta * blendedNumerator + (denominator / 2ULL)) / denominator);
    } else {
        step = -(int32_t)(((uint64_t)(-delta) * blendedNumerator + (denominator / 2ULL)) / denominator);
    }

    return (uint16_t)((int32_t)startPulse + step);
}

static uint16_t Servo_InterpolatePulse(uint16_t startPulse,
                                       uint16_t targetPulse,
                                       uint32_t elapsedMs,
                                       uint16_t durationMs,
                                       Servo_MotionProfileTypeDef profile,
                                       uint8_t easeStrengthPercent)
{
    int32_t delta = (int32_t)targetPulse - (int32_t)startPulse;
    int32_t step;

    if ((durationMs == 0U) || (elapsedMs >= durationMs)) {
        return targetPulse;
    }

    if (profile == SERVO_MOTION_PROFILE_ANTI_DROP) {
        uint16_t preloadDurationMs = (uint16_t)(((uint32_t)durationMs * SERVO_ANTI_DROP_PRELOAD_PERCENT) / 100U);
        uint16_t holdDurationMs = (uint16_t)(((uint32_t)durationMs * SERVO_ANTI_DROP_HOLD_PERCENT) / 100U);
        uint16_t descentDurationMs;
        uint16_t preloadPulse;
        uint32_t descentElapsedMs;

        if (delta >= 0) {
            return Servo_InterpolateSmoothStepPulse(startPulse,
                                                    targetPulse,
                                                    elapsedMs,
                                                    durationMs,
                                                    easeStrengthPercent);
        }

        if (preloadDurationMs < SERVO_MOTION_UPDATE_PERIOD_MS) {
            preloadDurationMs = SERVO_MOTION_UPDATE_PERIOD_MS;
        }
        if (holdDurationMs < SERVO_MOTION_UPDATE_PERIOD_MS) {
            holdDurationMs = SERVO_MOTION_UPDATE_PERIOD_MS;
        }
        if ((uint32_t)preloadDurationMs + (uint32_t)holdDurationMs >= durationMs) {
            preloadDurationMs = 0U;
            holdDurationMs = 0U;
        }

        preloadPulse = (uint16_t)(startPulse + SERVO_ANTI_DROP_PRELOAD_US);
        if (elapsedMs <= preloadDurationMs) {
            return Servo_InterpolateSmoothStepPulse(startPulse,
                                                    preloadPulse,
                                                    elapsedMs,
                                                    preloadDurationMs,
                                                    easeStrengthPercent);
        }
        if (elapsedMs <= ((uint32_t)preloadDurationMs + holdDurationMs)) {
            return preloadPulse;
        }

        descentElapsedMs = elapsedMs - preloadDurationMs - holdDurationMs;
        descentDurationMs = (uint16_t)(durationMs - preloadDurationMs - holdDurationMs);
        return Servo_InterpolateSmoothStepPulse(preloadPulse,
                                                targetPulse,
                                                descentElapsedMs,
                                                descentDurationMs,
                                                easeStrengthPercent);
    }

