orulink-ai/WatcheRobot/firmware/stm32-f103/User/Device/servo/servo.c
    if (profile == SERVO_MOTION_PROFILE_EASE_IN_OUT) {
        return Servo_InterpolateSmoothStepPulse(startPulse,
                                                targetPulse,
                                                elapsedMs,
                                                durationMs,
                                                easeStrengthPercent);
    } else if (delta >= 0) {
        step = (int32_t)(((uint32_t)delta * elapsedMs + (durationMs / 2U)) / durationMs);
    } else {
        step = -(int32_t)((((uint32_t)(-delta)) * elapsedMs + (durationMs / 2U)) / durationMs);
    }

    return (uint16_t)((int32_t)startPulse + step);
}

static uint8_t Servo_ShouldSkipSmallAntiDropStep(const Servo_StateTypeDef *state, uint16_t nextPulse, uint8_t complete)
{
    uint16_t diff;

    if ((state == NULL) || (complete != 0U) || (state->motionProfile != SERVO_MOTION_PROFILE_ANTI_DROP)) {
        return 0U;
    }

    diff = (nextPulse >= state->currentPulse) ? (uint16_t)(nextPulse - state->currentPulse)
                                              : (uint16_t)(state->currentPulse - nextPulse);
    return (diff < SERVO_ANTI_DROP_MIN_STEP_US) ? 1U : 0U;
}

static Servo_StatusTypeDef Servo_UpdateMotionAt(Servo_InstanceTypeDef *instance, uint32_t nowTickMs, uint8_t force)
{
    uint32_t elapsedMs;
    uint16_t nextPulse;
    uint16_t updatePeriodMs;
    uint8_t complete;

    if (instance == NULL) {
        return SERVO_ERROR_PARAM;
    }

    if (instance->state.isMotionActive == 0U) {
        return SERVO_OK;
    }

    elapsedMs = nowTickMs - instance->state.motionStartedAtMs;
    complete = (elapsedMs >= instance->state.motionDurationMs) ? 1U : 0U;
    updatePeriodMs = Servo_NormalizeMotionUpdatePeriod(instance->state.motionUpdatePeriodMs);
    if ((force == 0U) && (complete == 0U) &&
        ((uint32_t)(nowTickMs - instance->state.lastMotionUpdateTickMs) < updatePeriodMs)) {
        return SERVO_OK;
    }

    nextPulse = Servo_InterpolatePulse(instance->state.motionStartPulse,
                                      instance->state.motionTargetPulse,
                                      elapsedMs,
                                      instance->state.motionDurationMs,
                                      instance->state.motionProfile,
                                      instance->state.motionEaseStrengthPercent);
    nextPulse = Servo_ClampPulse(&instance->config, nextPulse);
    if ((force == 0U) && (Servo_ShouldSkipSmallAntiDropStep(&instance->state, nextPulse, complete) != 0U)) {
        return SERVO_OK;
    }
    instance->state.currentPulse = nextPulse;
    instance->state.lastMotionUpdateTickMs = nowTickMs;
    if (complete != 0U) {
        instance->state.isMotionActive = 0U;
        instance->state.targetPulse = instance->state.motionTargetPulse;
        instance->state.currentPulse = instance->state.motionTargetPulse;
        instance->state.motionDurationMs = 0U;
        instance->state.motionUpdatePeriodMs = updatePeriodMs;
    }

    if (Servo_WritePulseInternal(&instance->config, instance->state.currentPulse) != SERVO_OK) {
        return SERVO_ERROR_PARAM;
    }

    instance->state.isSignalActive = 1U;
    Servo_ArmReleaseDeadline(instance, nowTickMs);
    return SERVO_OK;
}

static Servo_StatusTypeDef Servo_InitFeedback(Servo_ConfigTypeDef *config)
{
    if (config->pFeedbackAdcHandle == NULL) {
        return SERVO_OK;
    }

    return (HAL_ADCEx_Calibration_Start(config->pFeedbackAdcHandle) == HAL_OK) ? SERVO_OK : SERVO_ERROR_INIT;
}

static Servo_StatusTypeDef Servo_ReadFeedbackPair(ADC_HandleTypeDef *adcHandle, uint16_t *sample1, uint16_t *sample2)
{
    if ((adcHandle == NULL) || (sample1 == NULL) || (sample2 == NULL)) {
        return SERVO_ERROR_PARAM;
    }

    if (HAL_ADC_Start(adcHandle) != HAL_OK) {
        return SERVO_ERROR;
    }

    if (HAL_ADC_PollForConversion(adcHandle, SERVO_FEEDBACK_ADC_TIMEOUT_MS) != HAL_OK) {
        (void)HAL_ADC_Stop(adcHandle);
        return SERVO_ERROR;
    }
    *sample1 = (uint16_t)HAL_ADC_GetValue(adcHandle);

    if (HAL_ADC_PollForConversion(adcHandle, SERVO_FEEDBACK_ADC_TIMEOUT_MS) != HAL_OK) {
        (void)HAL_ADC_Stop(adcHandle);
        return SERVO_ERROR;
    }
    *sample2 = (uint16_t)HAL_ADC_GetValue(adcHandle);

    return (HAL_ADC_Stop(adcHandle) == HAL_OK) ? SERVO_OK : SERVO_ERROR;
}

static void Servo_ArmReleaseDeadline(Servo_InstanceTypeDef *instance, uint32_t nowTickMs)
{
    if (instance->config.commandPulseCount == 0U) {
        instance->state.releaseDeadlineMs = 0U;
        return;
    }

    instance->state.releaseDeadlineMs =
        nowTickMs + ((uint32_t)instance->config.commandPulseCount * SERVO_PWM_FRAME_PERIOD_MS);
}

static void Servo_ReleaseSignalInternal(Servo_InstanceTypeDef *instance)
{
    (void)Servo_WritePulseInternal(&instance->config, SERVO_RELEASE_PULSE_US);
    instance->state.isSignalActive = 0U;
}

static uint8_t Servo_HasDeadlineElapsed(uint32_t nowTickMs, uint32_t deadlineTickMs)
{
    return ((int32_t)(nowTickMs - deadlineTickMs) >= 0) ? 1U : 0U;
}
